tests/load/public-pages-staged.yml
config:
  target: "http://localhost:9323"
  phases:
    - duration: 60
      arrivalRate: 20
      name: baseline
    - duration: 120
      arrivalRate: 100
      name: medium
    - duration: 120
      arrivalRate: 250
      name: high
    - duration: 120
      arrivalRate: 500
      name: stress
  defaults:
    headers:
      Accept: "text/html,application/json"
  plugins:
    metrics-by-endpoint: {}

scenarios:
  - name: public-pages-mix
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/exhibitors"
      - think: 1
      - get:
          url: "/partners"
      - think: 1
      - get:
          url: "/news"